Revit 2027 API
Document.PanelTypes Property
Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelTypeSet PanelTypes { get; }
Public ReadOnly Property PanelTypes As PanelTypeSet
	Get
public:
property PanelTypeSet^ PanelTypes {
	PanelTypeSet^ get ();
}
member PanelTypes : PanelTypeSet with get
Property Value
PanelTypeSet
Remarks
This property returns a set of panelType objects. These objects can be used change the type of a panel from one type to another.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace